module.exports.config = {
	name: "murgi",
	version: "1.0.2",
	permission: 2,
	credits: "nayan",
	prefix: false,
	description: "",
	category: "without prefix",
	usages: "[tag]",
	cooldowns: 5
};

module.exports.run = async function({ api, args, Users, event}) {
    var mention = Object.keys(event.mentions)[0];
    if(!mention) return api.sendMessage("SHADHIN BOSS কোনমাদাচোদ কি বলছে ? কারে চুদবো তারাতাড়ি কও নুনু খারা হয়ে গেছে 😕", event.threadID);
 let name =  event.mentions[mention];
    var arraytag = [];
        arraytag.push({id: mention, tag: name});
    var a = function (a) { api.sendMessage(a, event.threadID); }
a("নেও হোগা মারা খাও 😴");
setTimeout(() => {a({body: "1 2 3 তোমার মাইরে আমি চুদি 😁" + " " + name, mentions: arraytag})}, 3000);
setTimeout(() => {a({body: "বম বম বম বম বম বম মাল আউট " + " " + name, mentions: arraytag})}, 5000);
setTimeout(() => {a({body: "এ ভোদাই তোর সাহস কতো বে খানকির পোলা মানে একবার ভাবা জার কার সাথে ভাব নিতে আইছে 👅" + " " + name, mentions: arraytag})}, 7000);
setTimeout(() => {a({body: "তোরো আমি BOOM Boom Boom Boom Boom করে চুদি 🖕 !" + " " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: "স্বাধীন তোর বাপ লাগে চিনে রাখ 👑😒" + " " + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: " এ বাইনচোদ তোর সহস কতো ? আমার বস কে গালি দিছোস " + " " + name, mentions: arraytag})}, 15000);
setTimeout(() => {a({body: "Amar Babu Taaa Koi Tumii Cdua Kaba Na 😞 Putki Fuk Koro bby Shadhin Cudbay Toh  " + " " + name, mentions: arraytag})}, 17000);
setTimeout(() => {a({body: "SHADHIN BOSS 🌚দেখো তার দাম শেষ একবারে হোগা লাল করে দিছি💀👄 " + " " + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: "ahhhhhhh offfffff স্বাধীন বস এর পোলার নাকি লাগতেছে আস্তে দিলাম💧" + " " + name, mentions: arraytag})},23000);
setTimeout(() => {a({body: "VUDAI SALA PROTIBONDI আমার বস এর গু খা কাজে লাইবে " + " " + name, mentions: arraytag})}, 25000);
setTimeout(() => {a({body: "👄👄👄👄👄 মামা উল্টা হও এভাবে মজা নাই 👄👄 " + " " + name, mentions: arraytag})}, 28500);
setTimeout(() => {a({body: "KERA banging Koi ? " + " " + name, mentions: arraytag})},31000);
setTimeout(() => {a({body: "KERA banging Koi ?  " + " " + name, mentions: arraytag})}, 36000);
setTimeout(() => {a("~ আমাল বেবি টাহ স্বাধীনের ছেলে টা uuuammmmm Love YOU Bby ")} , 39000);
setTimeout(() => {a({body: "এ ধুর মাল বের হয়ে গেলো 😭😭😭😭😭😭😭" + " " + name, mentions: arraytag})}, 42000);
setTimeout(() => {a({body: "ধুরররররররর" + " " + name, mentions: arraytag})}, 48000);
setTimeout(() => {a({body: "Boooommmmmmm দিলাম পুরকি মেরেরেএএএএএএএএএএএএএ 👄👄👄👄👄👄👄 " + " " + name, mentions: arraytag})}, 51000);
setTimeout(() => {a({body: "💀 হা করো নুনু দিতেছি তোমারে 👄👄👄👄👄 " + " " + name, mentions: arraytag})}, 54000);
setTimeout(() => {a({body: "মজা না বন্ধু? " + " " + name, mentions: arraytag})}, 57000);
setTimeout(() => {a({body: " আকাশে অনেক তারাভিরেএএএএএ পরে জানি না কিন্তু তেরো চুদি 😁 " + " " + name, mentions: arraytag})}, 59400);
setTimeout(() => {a({body: "Bbyyyyyyy  Lagasaa ????? " + " " + name, mentions: arraytag})}, 63000);
setTimeout(() => {a({body: "Boom 💥" + " " + name, mentions: arraytag})}, 66000);
setTimeout(() => {a({body: " চুদা খাবা না আর " + " " + name, mentions: arraytag})},69000);
setTimeout(() => {a({body: "নাস্তিকের দল খানকির পোলা 👄😭😁💧😁" + " " + name, mentions: arraytag})}, 72000);
setTimeout(() => {a({body: "আমার ছেলে" + " " + name, mentions: arraytag})}, 75000);
setTimeout(() => {a({body: "👅 Fuck bby Fuck you " + " " + name, mentions: arraytag})},81000);
setTimeout(() => {a({body: "🌚 VODAI 😂 " + " " + name, mentions: arraytag})}, 87000);
setTimeout(() => {a("~ Mal Kaba Bby ? ")} , 93000);
setTimeout(() => {a({body: "👅মাগির পোলা 🥰।" + " " + name, mentions: arraytag})}, 99000);
setTimeout(() => {a({body: "👅 তোর বউ এর দুদু খাই 👅" + " " + name, mentions: arraytag})}, 105000);
setTimeout(() => {a({body: "👅 ভোদাই শালা 👅 " + " " + name, mentions: arraytag})}, 111000);
setTimeout(() => {a({body: "Hআই স্বাধীনের মেয়ে  এর জারজ মাগির পোলা  💔!" + " " + name, mentions: arraytag})}, 114000);
setTimeout(() => {a({body: "২০ টাকা এ পতিতা মাগির পোলা " + " " + name, mentions: arraytag})}, 120000);
setTimeout(() => {a({body: "depression থেকেও তর মাইরে চু*** দি 🤬 " + " " + name, mentions: arraytag})}, 126000);
setTimeout(() => {a({body: "বস্তির ছেলে অনলাইনের কিং" + " " + name, mentions: arraytag})}, 132000);
setTimeout(() => {a({body: "টুকাই মাগির পোলা🤟" + " " + name, mentions: arraytag})}, 138000);
setTimeout(() => {a({body: "তর আম্মু রে পায়জামা খুলে চুদি 🤣" + " " + name, mentions: arraytag})},144000);
setTimeout(() => {a({body: "উম্মম্মা তর বোন এরকচি ভুদায়💉।" + " " + name, mentions: arraytag})}, 150000);
setTimeout(() => {a({body: "DNA টেষ্ট করা দেখবি আমার চুদা তেই তর জন্ম।" + " " + name, mentions: arraytag})}, 156000);
setTimeout(() => {a({body: "হিজলা মাগির পোলা  ✋" + " " + name, mentions: arraytag})},162000);
setTimeout(() => {a({body: " বস্তিরন্দালাল এর বাচ্ছা বস্তির পোলা " + " " + name, mentions: arraytag})}, 168000);
setTimeout(() => {a("~ আমার জারজ শন্তান জা ভাগ🤖")} , 171000);
setTimeout(() => {a({body: "Welcome শুয়োরের বাচ্চা 🥰।" + " " + name, mentions: arraytag})}, 174000);
setTimeout(() => {a({body: "কুত্তার বাচ্ছা তর কচি বোন এর পম পম😍.." + " " + name, mentions: arraytag})}, 177000);
setTimeout(() => {a({body: "খাঙ্কিরপোলা পোলা কথা শুন তর আম্মু রে চুদি গামছা পেচিয়ে🐰" + " " + name, mentions: arraytag})}, 180000);
setTimeout(() => {a({body: "Hi নয়ন এর জারজ পোলা মাগির পোলা  💔!" + " " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: "খান্কি মাগির পোলা " + " " + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: "তোর বাপে তোর নানা। 🤬 " + " " + name, mentions: arraytag})}, 15000);
setTimeout(() => {a({body: "বস্তির ছেলে তোর বইনরে মুসলমানি দিমু।" + " " + name, mentions: arraytag})}, 17000);
setTimeout(() => {a({body: "টুকাই মাগির পোলা মোবাইল ভাইব্রেশন কইরা তুর কচি বোন এর পুকটিতে ভরবো।🤟" + " " + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: "তোর মুখে হাইগ্যা দিমু। 🤣" + " " + name, mentions: arraytag})},23000);
setTimeout(() => {a({body: "কুত্তার পুকটি চাটামু💉।" + " " + name, mentions: arraytag})}, 25000);
setTimeout(() => {a({body: "তর আম্মুর হোগা দিয়া ট্রেন ভইরা দিমু।।" + " " + name, mentions: arraytag})}, 28500);
setTimeout(() => {a({body: "হিজলা মাগির পোলা হাতির ল্যাওড়া দিয়া তর মায়েরে চুদুম।  ✋" + " " + name, mentions: arraytag})},31000);
setTimeout(() => {a({body: "তর বোন ভোদা ছিল্লা লবণ লাগায় দিমু। " + " " + name, mentions: arraytag})}, 36000);
setTimeout(() => {a("~ আমার ফাটা কন্ডমের ফসল। জা ভাগ🤖")} , 39000);
setTimeout(() => {a({body: "Welcome শুয়োরের বাচ্চা 🥰।" + " " + name, mentions: arraytag})}, 3000);
setTimeout(() => {a({body: "কুত্তার বাচ্ছা তর বৌন ভোদায় মাগুর মাছ চাষ করুম।😍.." + " " + name, mentions: arraytag})}, 5000);
setTimeout(() => {a({body: "খাঙ্কিরপোলা পোলা তর বোনের  হোগায় ইনপুট, তর মায়ের ভোদায় আউটপুট।🐰" + " " + name, mentions: arraytag})}, 7000);
setTimeout(() => {a({body: "তর মায়ের ভোদা বোম্বাই মরিচ দিয়া চুদামু।💔!" + " " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: "খান্কি মাগির পোলা তর মায়ের ভোদা শিরিষ কাগজ দিয়া ঘইষা দিমু। " + " " + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: "জং ধরা লোহা দিয়া পাকিস্তানের মানচিত্র বানাই্য়া তোদের পিছন দিয়া ঢুকামু।🤬 " + " " + name, mentions: arraytag})}, 15000);
setTimeout(() => {a({body: "বস্তির ছেলে তর মায়ের ভুদাতে পোকা।" + " " + name, mentions: arraytag})}, 17000);
setTimeout(() => {a({body: "টুকাই মাগির পোলা তর মার ভোদায় পাব্লিক টয়লেট।🤟" + " " + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: "তোর মুখে হাইগ্যা দিমু। ভুস্কি মাগির পোলা 🤣" + " " + name, mentions: arraytag})},23000);
setTimeout(() => {a({body: "কান্দে ফালাইয়া তর মায়েরে চুদি💉।" + " " + name, mentions: arraytag})}, 25000);
setTimeout(() => {a({body: "তর আম্মুর উপ্তা কইরা চুদা দিমু।।" + " " + name, mentions: arraytag})}, 28500);
setTimeout(() => {a({body: "হিজলা মাগির পোলা বালি দিয়া চুদমু তরে খাঙ্কি মাগী!তর মাকে।  ✋" + " " + name, mentions: arraytag})},31000);
setTimeout(() => {a({body: "তর বোন ভোদা ছিল্লা লবণ লাগায় দিমু। " + " " + name, mentions: arraytag})}, 36000);
setTimeout(() => {a("~ স্বাধীনের পুত। জা ভাগ🤖")} , 39000);



  
  }
